<font size="8"> Introduction to Pandas </font>


<font size="5"> Import libraries </font>

In [1]:
import numpy as np
import pandas as pd

<font size="5"> Initializing instances in Pandas </font>

In [2]:
df = pd.DataFrame({'Name': ['Elaine', 'Josh', 'Lin', 'Naho', 'Steve', 'Charles'],
                   'Age': [44, 17, 64, 33, 45, 25],
                   'Salary': [7000, 5800, 7900, 5600, 6700, 5900],
                   'Group': ['MA', 'NW', 'NM', 'WA', 'PA', 'TX']})
df

      Name  Age  Salary Group
0   Elaine   44    7000    MA
1     Josh   17    5800    NW
2      Lin   64    7900    NM
3     Naho   33    5600    WA
4    Steve   45    6700    PA
5  Charles   25    5900    TX


<font size="5"> Overview of the dataframe </font>

In [3]:
# check top rows
print(df.head())

     Name  Age  Salary Group
0  Elaine   44    7000    MA
1    Josh   17    5800    NW
2     Lin   64    7900    NM
3    Naho   33    5600    WA
4   Steve   45    6700    PA

In [4]:
# check bottom rows
print(df.tail(3))

      Name  Age  Salary Group
3     Naho   33    5600    WA
4    Steve   45    6700    PA
5  Charles   25    5900    TX

In [5]:
# check index
print(df.index)

RangeIndex(start=0, stop=6, step=1)

In [6]:
# check attribute names
print(df.columns)

Index(['Name', 'Age', 'Salary', 'Group'], dtype='object')

<font size="5"> Basic operations </font>

In [7]:
# Taking subsets of columns
print(df['Age'])

0    44
1    17
2    64
3    33
4    45
5    25
Name: Age, dtype: int64

In [8]:
# Selecting rows with index
print(df[2:4])

   Name  Age  Salary Group
2   Lin   64    7900    NM
3  Naho   33    5600    WA

In [9]:
# Selecting rows and columns together with value
print(df.loc[1:4, ['Salary','Name']])

   Salary   Name
1    5800   Josh
2    7900    Lin
3    5600   Naho
4    6700  Steve

In [10]:
# Selecting rows and columns together with index
print(df.iloc[1:4, 2:4])

   Salary Group
1    5800    NW
2    7900    NM
3    5600    WA

In [11]:
# Selecting rows and columns together with index
print(df.iloc[[1,3,4], [1,3]])

   Age Group
1   17    NW
3   33    WA
4   45    PA

In [12]:
# Selecting with query
print(df[df['Salary']>100])

      Name  Age  Salary Group
0   Elaine   44    7000    MA
1     Josh   17    5800    NW
2      Lin   64    7900    NM
3     Naho   33    5600    WA
4    Steve   45    6700    PA
5  Charles   25    5900    TX

In [13]:
# Selecting with multiple queries
print(df[(df['Salary']>100) & (df['Age']>30)])

     Name  Age  Salary Group
0  Elaine   44    7000    MA
2     Lin   64    7900    NM
3    Naho   33    5600    WA
4   Steve   45    6700    PA

In [14]:
# sort according to specific attribute
print(df.sort_values(by='Age', ascending=False))

      Name  Age  Salary Group
2      Lin   64    7900    NM
4    Steve   45    6700    PA
0   Elaine   44    7000    MA
3     Naho   33    5600    WA
5  Charles   25    5900    TX
1     Josh   17    5800    NW

In [15]:
df2 = pd.DataFrame({'Name': ['Chris', 'Peter'],
                   'Age': [18, np.nan],
                   'Salary': [np.nan, 9],
                   'Group': ['NV', 'FL']})

df_new = df.append(df2, ignore_index=True)
df_new

      Name   Age  Salary Group
0   Elaine  44.0  7000.0    MA
1     Josh  17.0  5800.0    NW
2      Lin  64.0  7900.0    NM
3     Naho  33.0  5600.0    WA
4    Steve  45.0  6700.0    PA
5  Charles  25.0  5900.0    TX
6    Chris  18.0     NaN    NV
7    Peter   NaN     9.0    FL

In [16]:
print(df_new.dropna(how='any', subset=['Salary']))

      Name   Age  Salary Group
0   Elaine  44.0  7000.0    MA
1     Josh  17.0  5800.0    NW
2      Lin  64.0  7900.0    NM
3     Naho  33.0  5600.0    WA
4    Steve  45.0  6700.0    PA
5  Charles  25.0  5900.0    TX
7    Peter   NaN     9.0    FL

In [17]:
print(df_new.fillna(value='None'))

      Name   Age  Salary Group
0   Elaine  44.0  7000.0    MA
1     Josh  17.0  5800.0    NW
2      Lin  64.0  7900.0    NM
3     Naho  33.0  5600.0    WA
4    Steve  45.0  6700.0    PA
5  Charles  25.0  5900.0    TX
6    Chris  18.0    None    NV
7    Peter  None     9.0    FL

In [18]:
# export as numpy array
print(df_new.values)

[['Elaine' 44.0 7000.0 'MA']
 ['Josh' 17.0 5800.0 'NW']
 ['Lin' 64.0 7900.0 'NM']
 ['Naho' 33.0 5600.0 'WA']
 ['Steve' 45.0 6700.0 'PA']
 ['Charles' 25.0 5900.0 'TX']
 ['Chris' 18.0 nan 'NV']
 ['Peter' nan 9.0 'FL']]

<font size="5"> Challenge </font>

Implement a function process() that given the path to a CSV file as input, select those entries with a valid license (not NaN), room type of Private room, price less than or equal to 80, minimum nights less than or equal to 2, number of reviewers more than or equal to 500, or those with a valid license (not NaN), a room type of Entire home/apt, price less than or equal to 100, minimum nights less than or equal to 1, number of reviewers more than or equal to 100, and finally present the result sorted according to latitude and then longitude in an ascending order and with only columns of id, latitude, longitude, room_type, price and availability_365.

In [56]:
def process(path):
    
    
    #Read CSV, replace Nones with Nan, and drop entries wih a nan license
    df = pd.read_csv(path).dropna(how='any', subset = ['license'])
    
    # Filter room type of Private room, price less than or equal to 80, 
    # minimum nights less than or equal to 2, 
    # number of reviewers more than or equal to 500
    df_private = df[(df['room_type']=='Private room') 
                    & (df['price'] <= 80)
                    & (df['minimum_nights'] <= 2) 
                    & (df['number_of_reviews'] >= 500)]
    
    
    # Filter room type of Entire home/apt, price less than or equal to 100, 
    # minimum nights less than or equal to 1, 
    # number of reviewers more than or equal to 100
    df_entire = df[(df['room_type']=='Entire home/apt') 
                    & (df['price']<=100)
                    & (df['minimum_nights'] <=1) 
                    & (df['number_of_reviews'] >= 100)]
    
          
    # Merge dataframes
    df_ret = df_private.append(df_entire, ignore_index=True)
    
    
    # Filter return df to include only columns of id, latitude, longitude, room_type, 
    # price and availability_365. Sort by latitude and then long in ascending order
    df_ret = df_ret[['id', 'latitude', 'longitude', 'room_type', 'price', 'availability_365']].sort_values(by=['latitude', 'longitude'], ascending=True)
    
    
    return df_ret
    
    
df = process('listings.csv')
print(df)

          id   latitude  longitude        room_type  price  availability_365
3    3508800  52.333100   4.903000     Private room     49                67
9   17774718  52.353180   4.846890  Entire home/apt     89               312
6    7276869  52.354920   4.898650     Private room     69                33
2    1247334  52.355960   4.903390     Private room     78                 0
5    7190115  52.356980   4.900150     Private room     71                21
7    7571471  52.358730   4.855080     Private room     65               282
1    1008223  52.365610   4.840380     Private room     51               324
10  22563427  52.369180   4.880470  Entire home/apt     94                44
4    4449764  52.373130   4.951460     Private room     69                 0
13  31731136  52.378250   4.892390  Entire home/apt     78                57
0     608432  52.381996   4.888583     Private room     56                42
11  28170875  52.383880   4.787870  Entire home/apt     99               312
12  28171967  52.383880   4.787870  Entire home/apt    100               292
8   10432232  52.386530   4.915340     Private room     75               132